Revit 2024 API
BuiltInFailures.SkylightFailures Class
 Failures about Skylight.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class SkylightFailures
Visual Basic
Public NotInheritable Class SkylightFailures
Visual C++
public ref class SkylightFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.SkylightFailures
See Also
BuiltInFailures.SkylightFailures Members
Autodesk.Revit.DB Namespace